{"data":{"contentfulBlogPost":{"id":"102d1ced-96c8-5df6-bc34-d05d58a476d7","slug":"welcome","tags":["Life","Website"],"title":"Welcome!","subtitle":"My First Blog Post","published":"November 21st, 2018","heroImage":{"id":"fe71f04f-29ab-56d1-8c9b-2e17d6e326af","title":"Speeding Train in Subway","description":"A blue train blurred by speeding through an underground subway.","file":{"url":"//images.ctfassets.net/oghc6wtiomc3/21DsNFJPgUms8sAyCWgwyA/6fe38399ec78feff169e6b564b60f153/olivier-collet-1165010-unsplash.jpg"}},"bodyContent":{"childMarkdownRemark":{"html":"<p>I'm so excited to have finally finished my blog. I've used some of my favorite tools to build it too: Gatsby, Contentful, and Netlify. So why did I build a blog and why did I choose these tools? I'm glad you asked.</p>\n<h2>Documenting My Web Development Journey</h2>\n<p>This past year or so, I've really grown a lot as a beginning developer. I began learning HTML and CSS right out of high school in 2015. I would finish up my homework in the student center, head over to the student computer center, and just sit and work on the Treehouse Front-end Web Development course. Even while doing my usual college things, I would still make time to learn web development. I was discovering more and more that I really loved it.</p>\n<p>Then I took a break - a pretty long one. After completing my first and only year at community college in 2016, I moved to Redding, CA for a year to attend a ministry school. It was one of the most amazing years of my life. Then in May of 2017, I moved back home, but at this point I was really lacking short-term vision and goals for my life.</p>\n<p>Naturally, I decided to fall back to what I had already started: web development. I re-subscribed to Treehouse and went all-in. I haven't regretted that for a moment. And now I'm here, building my own blog instead of letting Wordpress do it for me!</p>\n<p>Through my journey thus far, I've realized how valuable documenting everything would have been early-on (even though I'd say I'm still extremely early in my journey). So this is where I'm starting.</p>\n<h2>Just The Beginning</h2>\n<p>I'll be writing about my thoughts on certain technologies, updates on my career, or cool things I've found in the web development community. But this blog will be finely balanced with some Medium posts here and there as well. I miss writing and I want to do a lot more of it (writing code doesn't count).</p>\n<p>This is a short introduction of myself, my blog, and what's to come.</p>\n<p>Speaking of what's to come, I will have blog posts on my experience with Gatsby, Contentful, and Netlify very soon!</p>\n<p>Spoiler: they're all amazing tools and make a great three-way marriage.</p>\n<p>Have a fantastic day, I'll talk to you soon!</p>","excerpt":"I'm so excited to have finally finished my blog. I've used some of my favorite tools to build it too: Gatsby, Contentful, and Netlify. So…"}},"author":{"id":"184c794a-b337-50ca-8b95-a4293d5c79c7","name":"Jacob D. Castro","email":"jdcastro.business@gmail.com","birthday":"1997-05-27T06:32-07:00","twitterURL":"https://twitter.com/jacobdcastro/","instagramURL":"https://instagram.com/jacobdcastro/","githubURL":"https://github.com/jacobdcastro/","avatar":{"file":{"url":"//images.ctfassets.net/oghc6wtiomc3/1jW1gN58D4W2I8WEe6gOuY/24a28ad6a13d72b9f97a991d3ce83251/me-in-chicago-2017.jpg"}},"biography":{"biography":"I love front-end web development. I also really love sports and super deep ideas! Follow me everywhere => @jacobdcastro"}}}},"pageContext":{"slug":"welcome"}}